<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
<c:set var="ctp" value="${pageContext.request.contextPath}"/>
<!DOCTYPE html>
<html>
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>LCK</title>
  <jsp:include page="/WEB-INF/views/include/bs4.jsp" />
</head>
<body>
<jsp:include page="/WEB-INF/views/include/slide2.jsp" />
<jsp:include page="/WEB-INF/views/include/nav.jsp" />

<p><br/></p>
<div class="container">
  <h1>LCK는</h1>
  <hr/><br/>
  <div>
  리그 오브 레전드 챔피언스 코리아(League of Legends Champions Korea)는 라이엇 게임즈에서 주최 및 주관하는 대한민국의 최상위 리그 오브 레전드 대회이다. 2012년부터 시행되어왔으며 2021시즌을 앞두고 프렌차이즈 제도를 새롭게 실시하였다.
  <p><br/></p>
  2012년 리그 창설부터 2016년 스프링 시즌까지 OGN 단독으로 리그 오브 레전드 챔피언스 코리아를 주관하였으며 2016년 서머 시즌부터는 SPOTV GAMES가 리그 오브 레전드 챔피언스 코리아 중계에 참여, 두 개의 방송사에서 리그 오브 레전드 챔피언스 코리아를 중계하였다. 2019년 스프링 시즌부터는 라이엇 게임즈에서 직접 중계하며, 트위치, 아프리카TV 페이스북, SBS afreeca 채널, 네이버TV, 유튜브 등에서 송출 하고 있다. 2020년에는 OGN이 녹화방송으로 중계에 재참여하게 되었다.
  <hr/>
  <p><br/><p>
  </div>
  <h3>시즌 2(2012년) ~ 2014 시즌</h3><hr/>
  <div>
	2014 시즌까지는 리그 오브 레전드 챔피언스라는 이름으로 진행되었으며, 전 시즌 우수 팀 8팀과 예선 통과 8팀, 총 16개 팀이 참가하여 16강 조별 리그 후 8강 토너먼트를 진행하는 방식으로 이루어졌다. 16강과 8강에서 탈락한 팀은 하부 리그인 나이스게임TV 리그 오브 레전드 배틀(NLB)로 강등되어 계속해서 시즌을 치르게 되었다. 대회 또한 3시즌제로 진행되어 윈터, 스프링, 서머 시즌이 진행되었으며, 매 시즌 획득한 서킷 포인트를 통해 리그 오브 레전드 월드 챔피언십에 참가할 팀을 선발하였다.
	<br/>
	참가 가능한 팀은 한 구단에 최대 2개 팀까지 허용되었으며, 각 팀내 선수의 수는 최소 5명에서 최대 7명까지 허용되었다.
	<br/><hr/>
	<h3>2015 시즌 ~ 2018 시즌</h3><hr/>
	2015 시즌부터 대회명이 리그 오브 레전드 챔피언스 코리아로 변경되었으며, 윈터, 스프링, 서머의 3시즌제에서 스프링, 서머의 2시즌제로 바뀌었다. 대회 방식 또한 토너먼트제에서 풀리그 후 플레이오프 방식으로 바뀌었다. 참가 팀 또한 16팀에서 10팀(2015 스프링 시즌에 한해 8팀)으로 줄어들었으며 단일 클럽 내 복수 팀의 참가가 불가능하게 바뀌었다. 풀리그 후 플레이오프 진출 방식은 이러하다. 먼저 정규시즌 1위를 차지한 팀은 바로 결승전으로 직행하고 4위팀과 5위팀은 와일드카드 결정전을 통해 3위팀과의 준플레이오프를 치를 팀을 결정했다. 그리고 준플레이오프에서 승리한 팀은 2위팀과의 플레이오프를 통해 결승 진출 여부를 결정지었다. 반대로 정규시즌 6위부터 8위팀까지는 포스트시즌 진출에 실패하더라도 챔피언스 코리아에 잔류하며 챔피언스 9·10위팀은 리그 오브 레전드 챌린저스 코리아 우승·준우승팀과의 승강결정전(승강전)을 통해 참가팀 교체 여부를 결정짓는 방식으로 진행되었다.
	<br/><hr/>
	<h3>2019 시즌 ~ 2020 시즌</h3><hr/>
	2019 시즌부터 대회명에 다시 타이틀 스폰서가 붙기 시작하였으며 라이엇 게임즈에서 직접 주관하게 되었다. 2021 스프링 시즌부터는 프랜차이즈가 도입되면서 2020 서머 승강전을 끝으로 챌린저스 코리아와의 승강제가 폐지되었다.
	<br/><hr/>
	<h3>2021 시즌 ~ 2022 시즌</h3><hr/>
	LCK 스프링 2021 시즌부터는 KBL의 6강 포스트시즌 방식을 차용한 제도가 도입됨에 따라 정규시즌 1위팀은 결승 직행 대신 2위팀과 함께 4강 플레이오프에 직행하고 3위부터 6위팀까지는 6강 플레이오프에 직행한다. 특히 1위팀에게는 4강 플레이오프 상대를 결정할 수 있는 어드밴티지가 주어지며 6강 플레이오프에서 승리한 2팀은 정규시즌 1·2위팀과 함께 결승 티켓을 놓고 자웅을 겨루며 4강 플레이오프에서 승리한 2팀은 결승에 직행하여 우승의 향방을 결정짓는다.
	<br/><hr/>
	2022년 7월 25일, 프렌차이즈 도입 2년 차를 맞은 LCK가 지정선수 특별 협상, 공인 에이전트, 신인선수 육성권 제도 도입을 예고했다
  </div>
</div>
<p><br/></p>
<jsp:include page="/WEB-INF/views/include/footer.jsp" />
</body>
</html>